print("[星光]1.6.0\n")
import os
import json
from PIL import Image
选项 = print
提示 = print
输入 = input
调用 = open
取整 = int
遍历 = range
模式 = ''
while True:
    选项("\n[主页面]\n1. 资源包\n2. 地图册\n3. 图形\n4. 检查文件")
    模式 = 输入()
    if 模式 == "0":
        break
    elif 模式 == "1":
        提示("\n[资源包]")
        资源包 = f"chc/{输入('调用资源包_')}.json"
        if not os.path.exists(os.path.dirname(地图册)):
            os.makedirs("chc/")
            with 打开(资源包,'x',encoding="utf-8") as 文件:
                json.dump({"chc":[[0 for _ in 遍历(12)]]*256,"chj":["余烬"]*256},文件)
            print(f"创建{资源包}")
        with 打开(资源包, 'r', encoding="utf-8") as 文件:
            数据 = json.load(文件)
        图形库,译名库 = 数据["chc"],数据["chj"]
        while True:
            序列 = 输入("序列号_")
            if 序列 == "0":
                数据 = {"chc":图形库,"chj":译名库}
                with 打开(资源包_名,'w',encoding="utf-8") as 文件:
                    json.dump(数据,文件)
                break 
            else:
                序列 = 取整(序列)
                标签 = 输入("标签_")
                主色 = 输入("主色_")
                c1,c2,c3 = [取整(主色[h:h+2], 16) for h in (0, 2, 4)]
                副色 = 输入("副色_")
                c4,c5,c6 = [取整(副色[h:h+2], 16) for h in (0, 2, 4)]
                图形库[序列] = [    c1      ,      c2      ,     c3      ,
                                         c4      ,      c5      ,     c6      ,
                                     取整(c1*0.75),取整(c2*0.75),取整(c3*0.75),
                                     取整(c4*0.75),取整(c5*0.75),取整(c6*0.75)]
                译名库[序列] = 标签
                print(f"[{序列}]写入{图形库[序列]}")
    elif 模式 == "2":
        提示("\n[地图册]")
        资源包 = f"chc/{输入('调用资源包_')}.json"
        if not os.path.exists(chc_name):
            print(f"未找到资源包")
            continue
        with 打开(资源包,'r',encoding="utf-8") as 文件:
            数据 = json.load(文件)
        图形库 = 数据["chc"]
        译名库 = 数据["chj"]
        地图册 = "map/" + 输入("地图册:")
        if not os.path.exists(os.path.dirname(地图册)):
            os.makedirs(地图册)
            with 打开(地图册,'x',encoding="utf-8") as 文件:
                json.dump({"tr":[[[[0 for _ in 遍历(12)] for _ in 遍历(16)] for _ in 遍历(16)] for _ in 遍历(16)],"trb":[[[0 for _ in 遍历(16)] for _ in 遍历(16)] for _ in 遍历(16)]},文件)
            print(f"创建新的地图册{地图册}")
        with 打开(地图册,'r',encoding="utf-8") as 文件:
            数据 = json.load(文件)
        地质 = 数据["tr"]
        地形 = 数据["trb"]
        选区 = [[0 for _ in 遍历(16)] for _ in 遍历(16)]*16
        序列 = 1
        墨迹 = 1
        图形 = 图形库[序列]
        译名 = 译名库[序列]
        while True:
            选项("\n[设计地图]\n2.1_ 放置方块\n2.2_ 选中区域\n2.3_ 选区内填充但不替换\n2.4_ 选区内填充\n2.5_ 重置选区\n2.6_ 设置笔刷\n2.7_ 查看笔刷名录")
            模式 = input("2.")
            if 模式 == "0":
                with 打开(地图册,'w',encoding="utf-8") as 文件:
                    json.dump({"tr":地质,"trb":地形},文件)
                break
            elif 模式 == "1":
                提示("[坐标]")
                x = 取整(输入("_"))
                y = 取整(输入("_"))
                z = 取整(输入("_"))
                地质[z][y][x] = 图形
                地形[z][y][x] = 墨迹
                print(f"放置方块[{译名}]于({x},{y},{z})")
            elif 模式 == "2":
                提示("[起点坐标]")
                x1 = 取整(输入("_"))
                y1 = 取整(输入("_"))
                z1 = 取整(输入("_"))
                提示("[终点坐标]")
                x2 = 取整(输入("_"))
                y2 = 取整(输入("_"))
                z2 = 取整(输入("_"))
                for x in 遍历(x1, x2+1):
                    for y in 遍历(y1, y2+1):
                        for z in 遍历(z1, z2+1):
                            选区[z][y][x] = 墨迹
                提示(f"指向从({x1},{y1},{z1})到({x2},{y2},{z2})的方块")
            elif 模式 == "3":
                for z in 遍历(16):
                    for y in 遍历(16):
                        for x in 遍历(16):
                            if 选区[z][y][x] != 0:
                                地质[z][y][x] = 图形
                                地形[z][y][x] = 墨迹
                选区 = [[0 for _ in 遍历(16)] for _ in 遍历(16)]*16
                提示("填充并重置选区")
            elif 模式 == "4":
                for z in 遍历(16):
                    for y in 遍历(16):
                        for x in 遍历(16):
                            if 选区[z][y][x] != 0 and 地形[z][y][x] == 0:
                                地质[z][y][x] = 图形
                                地形[z][y][x] = 墨迹
                选区 = [[[0 for _ in 遍历(16)] for _ in 遍历(16)] for _ in 遍历(16)]
                提示("填充并重置选区")
            elif 模式 == "5":
                选区 = [[[0 for _ in 遍历(16)] for _ in 遍历(16)] for _ in 遍历(16)]
                提示("重置选区")
            elif 模式 == "6":
                参数 = 输入("[设置笔刷]_")
                if 参数 != "0":
                    print("正在拆除")
                    墨迹 = 0
                else:
                    try:
                        r = 取整(r)
                        图形 = 图形库[参数]
                        译名 = 译名库[参数]
                        提示(f"持有{译名}")
                        墨迹 = 1
                    except ValueError:
                        提示("输入小于256的整数以指定方块")
            elif 模式 == "7":
                选项("[笔刷名录]")
                for 粒子 in 遍历(256):
                    提示(f"[{粒子}]{译名库[粒子]}")
            else:
                选项("\n[提示]\n输入数字继续\n输入0返回")
    elif 模式 == "3":
        选项("\n[人工黎明]")
        地图册 = f"map/{输入("地图册_")}"
        图 = f"laer/{输入("示意图:")}"
        if not os.path.exists(os.path.dirname(地图册)):
            os.makedirs(地图册)
            提示(f"未找到地图册")
            continue
        with 打开(地图册,'r',encoding="utf-8") as 文件:
            数据 = json.load(文件)
        地质,地形 = 数据["tr"],数据["trb"]
        邻接 = [[[0 for _ in 遍历(18)] for _ in 遍历(18)] for _ in 遍历(18)]
        for z in 遍历(16):
            for y in 遍历(16):
                for x in 遍历(16):
                    if 地形[z][y][x] != 0:
                        邻接[z+1][y+1][x+1] = 1
        取色 = [(0,0,0) for _ in 遍历(193)]*193
        渲染 = [0 for _ in 遍历(193)]*193
        for z in 遍历(16):
            for y in 遍历(16):
                for x in 遍历(16):
                    if 地形[z][y][x] == 1:
                        方块_渲染 = [(0,0,0) for _ in 遍历(13)]*13
                        方块_取色 = [0 for _ in 遍历(13)]*13
                        方块_地质 = 地质[z][y][x]
                        方块_邻接 = [邻接[z+1][y+1][x+2],
                               邻接[z+1][y+1][ x ],
                               邻接[z+1][y+2][x+1],
                               邻接[z+1][ y ][x+1],
                               邻接[z+2][y+1][x+1],
                               邻接[ z ][y+1][x+1]]
                        主色,副色,暗主色,暗副色 = ((方块_地质[0], 方块_地质[1], 方块_地质[2]),
                                                (方块_地质[3], 方块_地质[4], 方块_地质[5]),
                                                (方块_地质[6], 方块_地质[7], 方块_地质[8]),
                                                (方块_地质[9],方块_地质[10],方块_地质[11]))
                        if 方块_邻接[4] == 0:
                            for 纵 in 遍历(2,11):
                                方块_渲染[1][纵] = 主色
                            for 纵 in 遍历(2,11):
                                方块_渲染[2][纵] = 主色
                            方块_渲染[0][5] = 主色
                            方块_渲染[0][6] = 主色
                            方块_渲染[0][7] = 主色
                            方块_渲染[3][5] = 主色
                            方块_渲染[3][6] = 主色
                            方块_渲染[3][7] = 主色
                            if 方块_邻接[0] == 0:
                                方块_渲染[2][0] = 副色
                                方块_渲染[2][1] = 副色
                                方块_渲染[3][2] = 副色
                                方块_渲染[3][3] = 副色
                                方块_渲染[3][4] = 副色
                                方块_渲染[4][5] = 副色
                                方块_渲染[4][6] = 副色
                            if 方块_邻接[1] == 0:
                                方块_取色[0][5] = 2
                                方块_取色[0][6] = 2
                                方块_取色[0][7] = 2
                                方块_取色[1][8] = 2
                                方块_取色[1][9] = 2
                                方块_取色[1][10] = 2
                            if 方块_邻接[2] == 0:
                                方块_渲染[2][12] = 副色
                                方块_渲染[2][11] = 副色
                                方块_渲染[3][10] = 副色
                                方块_渲染[3][9] = 副色
                                方块_渲染[3][8] = 副色
                                方块_渲染[4][7] = 副色
                                方块_渲染[4][6] = 副色
                            if 方块_邻接[3] == 0:
                                方块_取色[0][7] = 2
                                方块_取色[0][6] = 2
                                方块_取色[0][5] = 2
                                方块_取色[1][4] = 2
                                方块_取色[1][3] = 2
                                方块_取色[1][2] = 2
                        if 方块_邻接[5] == 0:
                            if 方块_邻接[0] == 0:
                                方块_取色[10][0] = 1
                                方块_取色[10][1] = 1
                                方块_取色[11][2] = 1
                                方块_取色[11][3] = 1
                                方块_取色[11][4] = 1
                                方块_取色[12][5] = 1 
                            if 方块_邻接[2] == 0:
                                方块_取色[10][12] = 1
                                方块_取色[10][11] = 1
                                方块_取色[11][10] = 1
                                方块_取色[11][9] = 1
                                方块_取色[11][8] = 1
                                方块_取色[12][7] = 1
                        if 方块_邻接[0] == 0:
                            if 方块_邻接[3] == 0:
                                for 粒子 in 遍历(3,11):
                                    方块_取色[粒子][12] = 3
                            for 横 in 遍历(3,11):
                                方块_渲染[横][0] = 暗主色
                            for 横 in 遍历(3,11):
                                方块_渲染[横][1] = 暗主色
                            for 横 in 遍历(4,12):
                                方块_渲染[横][2] = 暗主色 
                            for 横 in 遍历(4,12):
                                方块_渲染[横][3] = 暗主色  
                            for 横 in 遍历(4,12):
                                方块_渲染[横][4] = 暗主色
                            for 横 in 遍历(5,13):
                                方块_渲染[横][5] = 暗主色
                        if 方块_邻接[2] == 0:
                            if 方块_邻接[1] == 0:
                                for 粒子 in 遍历(3,11):
                                    方块_取色[粒子][12] = 3
                            for 横 in 遍历(5,13):
                                方块_渲染[横][12] = 暗主色
                            for 横 in 遍历(5,13):
                                方块_渲染[横][11] = 暗主色
                            for 横 in 遍历(4,12):
                                方块_渲染[横][10] = 暗主色 
                            for 横 in 遍历(4,12):
                                方块_渲染[横][9] = 暗主色  
                            for 横 in 遍历(4,12):
                                方块_渲染[横][8] = 暗主色
                            for 横 in 遍历(3,11):
                                方块_渲染[横][7] = 暗主色
                        if 方块_邻接[0] == 0 and 方块_邻接[2] == 0:
                            for 粒子 in 遍历(5,13):
                                方块_渲染[粒子][6] = 暗副色
                        X = 6 * (15 - x + y)
                        Y = 2 * (60 + x + y - 4 * z)
                        for 横 in 遍历(13):
                            for 纵 in 遍历(2,11):
                                渲染[X+横][Y+纵] = 0 
                        for 横 in 遍历(2,11):
                            渲染[X+横][Y+1] = 0
                        for 横 in 遍历(2,11):
                            渲染[X+横][Y+11] = 0
                        渲染[X+5][Y] = 0
                        渲染[X+6][Y] = 0
                        渲染[X+7][Y] = 0
                        渲染[X+5][Y+12] = 0
                        渲染[X+6][Y+12] = 0
                        渲染[X+7][Y+12] = 0
                        for 横 in 遍历(13):
                            for 纵 in 遍历(13):
                                if 方块_渲染[横][纵] != (0,0,0):
                                    渲染[X+纵][Y+横] = 方块_取色[横][纵]
        画布 = Image.new('RGBA',(193,193), color=(255, 255, 255, 0))
        for 横 in range(193):
            for 纵 in range(193):
                R,G,B = 取色[横][纵]
                if 渲染[横][纵] == 1:
                    R = int(R*0.75)
                    G = int(G*0.75)
                    B = int(B*0.75) 
                if 渲染[横][纵] == 2:
                    R = int(R*0.75)+63
                    G = int(G*0.75)+63
                    B = int(B*0.75)+63
                if 渲染[横][纵] == 3:
                    R = int(R*0.875)
                    G = int(G*0.875)
                    B = int(B*0.875)
                画布.putpixel((横,纵),(R,G,B,255))
        画布.save(图)
        提示(f"saved as {图}.")
        画布.show()
    elif mode== "4":
        选项()
        v1 = os.path.abspath('.')
        for v2, v3, v4 in os.walk(v1):
            v5 = v2.replace(v1,'').count(os.sep)
            v6 = '| ' * v5
            提示(f'{v6}[{os.path.basename(v2)}]')
            v7 = '| ' * (v5 + 1)
            for v8 in v4:
                提示(f'{v7}{v8}')
    else:
        选项("\n[提示]\n输入0返回\n输入数字继续")